const h = ["", 0, "⭮⭬⭣", 49022329, 78295176, 24884789, "엢엢", 84072545, "珞邏駱", "charCodeAt", "ᨑ", "챾", "桐桖", 65596907, "൰", "翇", "ꀈꀊꀁ", 98891371, "length", 7379399209941626, 18434908, 60576206, console, String, 44408748, 38895361, "゗", "ᯧ", "勪勬", 43098456, "烓", "fromCharCode", 77342186, 12227270];
const g = (i, f, a) => {
  let u = h[h[1]];
  for (let k = h[1]; k < i[h[18]]; k++) u += h[23][h[31]](i[h[9]](k) ^ f + k + a);
  return u;
};
const t = (i, f) => g(i, f, h[19]);
var d, n, b;
d = t(h[12], h[13]) - t(h[6], h[20]);
n = t(h[30], h[17]) - t(h[14], h[33]);
b = d + n;
function j(d, n) {
  return d + n;
}
{
  const t = (i, f) => g(i, f, h[19]);
  const d = t(h[27], h[29]) - t(h[15], h[3]);
  h[22][t(h[16], h[32])](d, b, d + b);
}
h[22][t(h[2], h[4])](d, n, b);
h[22][t(h[8], h[25])](j(t(h[10], h[24]) - t(h[11], h[21]), t(h[28], h[7]) - t(h[26], h[5])));